## Concatenation

In [1]:
import pandas as pd

In [3]:
df1= pd.DataFrame(
    {
        "acc":[1,2,3], "name":[0,0,8], "age":[2,4,6]
    }
)

df2= pd.DataFrame(
    {
        "acc":[1,2,3], "loan":[30,40,8], 
    }
)

In [5]:
df1

   acc  name  age
0    1     0    2
1    2     0    4
2    3     8    6

In [6]:
df2

   acc  loan
0    1    30
1    2    40
2    3     8

In [8]:
row_concat = pd.concat([df1,df2], axis=0 )

In [9]:
row_concat

   acc  name  age  loan
0    1   0.0  2.0   NaN
1    2   0.0  4.0   NaN
2    3   8.0  6.0   NaN
0    1   NaN  NaN  30.0
1    2   NaN  NaN  40.0
2    3   NaN  NaN   8.0

In [10]:
column_concat = pd.concat([df1,df2], axis=1 )

In [11]:
column_concat

   acc  name  age  acc  loan
0    1     0    2    1    30
1    2     0    4    2    40
2    3     8    6    3     8

## Merging

In [20]:
df3= pd.DataFrame(
    {
        "key":['A','B','C','D'], "inv_no":[99,90,48,33], "acc":[2,4,6,8]
    }
)

df4= pd.DataFrame(
    {
        "key":['E','F','G','H'], "hel_relation":[20,40,83,33], "acc":[22,33,44,55] 
    }
)

In [21]:
df3

  key  inv_no  acc
0   A      99    2
1   B      90    4
2   C      48    6
3   D      33    8

In [22]:
df4

  key  hel_relation  acc
0   E            20   22
1   F            40   33
2   G            83   44
3   H            33   55

In [32]:
pd.merge(df3, df4, how = 'inner',on = 'key')

Empty DataFrame
Columns: [key, inv_no, acc_x, hel_relation, acc_y]
Index: []

In [30]:
pd.merge(df3, df4, how = 'left',on = 'key', suffixes=("_df2","_df3"))

  key  inv_no  acc_df2  hel_relation  acc_df3
0   A      99        2           NaN      NaN
1   B      90        4           NaN      NaN
2   C      48        6           NaN      NaN
3   D      33        8           NaN      NaN

In [31]:
pd.merge(df3, df4, how = 'right',on = 'key', suffixes=("_df2","_df3"))

  key  inv_no  acc_df2  hel_relation  acc_df3
0   E     NaN      NaN            20       22
1   F     NaN      NaN            40       33
2   G     NaN      NaN            83       44
3   H     NaN      NaN            33       55

In [33]:
pd.merge(df3, df4, how = 'outer',on = 'key', suffixes=("_df2","_df3"))

  key  inv_no  acc_df2  hel_relation  acc_df3
0   A    99.0      2.0           NaN      NaN
1   B    90.0      4.0           NaN      NaN
2   C    48.0      6.0           NaN      NaN
3   D    33.0      8.0           NaN      NaN
4   E     NaN      NaN          20.0     22.0
5   F     NaN      NaN          40.0     33.0
6   G     NaN      NaN          83.0     44.0
7   H     NaN      NaN          33.0     55.0

In [37]:
df3.merge(df4, how = "inner", on= "key")

Empty DataFrame
Columns: [key, inv_no, acc_x, hel_relation, acc_y]
Index: []

## joining